** Get Device
#+NAME: Find Serial Devices
#+BEGIN_SRC shell :dir /sudo:: :results raw drawer
echo "Usually the device is named ttyUSB#"
sudo dmesg | grep tty
#+END_SRC

#+RESULTS: Find Serial Devices
:results:
Usually the device is named ttyUSB#
[    0.131904] printk: console [tty0] enabled
[    0.414941] tty tty33: hash matches
[    3.864352] systemd[1]: Created slice Slice /system/getty.
[    5.232450] dw-apb-uart.2: ttyS4 at MMIO 0x9432e000 (irq = 20, base_baud = 115200) is a 16550A
[    7.412340] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
:end:

** Connect to device
#+NAME: Connect to Device
#+BEGIN_SRC shell :dir /sudo:: :results raw drawer
echo "Usually the device is named ttyUSB#"
sudo dmesg | grep tty
#+END_SRC

#+RESULTS: Find Serial Devices
:results:
Usually the device is named ttyUSB#
[    0.131904] printk: console [tty0] enabled
[    0.414941] tty tty33: hash matches
[    3.864352] systemd[1]: Created slice Slice /system/getty.
[    5.232450] dw-apb-uart.2: ttyS4 at MMIO 0x9432e000 (irq = 20, base_baud = 115200) is a 16550A
[    7.412340] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
:end:

